# ToposolidType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ToposolidType Class
Members See Also
---
An object that specifies the type of a Toposolid in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public class ToposolidType : HostObjAttributes
```

Visual Basic
---
```text
Public Class ToposolidType _
	Inherits HostObjAttributes
```

Visual C++
---
```text
public ref class ToposolidType : public HostObjAttributes
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..HostObjAttributes Autodesk.Revit.DB..::..ToposolidType
# See Also
ToposolidType Members
Autodesk.Revit.DB Namespace